strong_params_library_app/app/controllers/model_book_controller.rb

INSERT INTO "books" ("title", "author", "check_out_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "oh the places"], ["author", "dr suess"], ["check_out_date", "8/4/2020"], ["created_at", "2020-08-04 21:20:47.866120"], ["updated_at", "2020-08-04 21:20:47.866120"]]
---
  def create
    #add book params as the argument of .create
    @book = Book.create(book_params)